xampp/htdocs/ci4-login/app/Controllers/AnimalsController.php

SELECT `animals`.*, `pens`.`name` AS `pen`, `animal_types`.`name` AS `animal_type`, `breeds`.`name` AS `breed`, `companies`.`name` AS `company`, `countries`.`name` AS `country`
FROM `animals`
LEFT JOIN `pens` ON `pens`.`id` = `animals`.`pen_id`
LEFT JOIN `animal_types` ON `animal_types`.`id` = `animals`.`animal_type_id`
LEFT JOIN `breeds` ON `breeds`.`id` = `animals`.`breed_id`
LEFT JOIN `companies` ON `companies`.`id` = `animals`.`company_id`
LEFT JOIN `countries` ON `countries`.`id` = `animals`.`country_id`
SELECT *
FROM `pens`
SELECT *
FROM `animal_types`
SELECT *
FROM `breeds`
SELECT *
FROM `companies`
SELECT *
FROM `countries`
---
    public function animalsList()
    {
        $db = \Config\Database::connect();

        $builder = $db->table('animals');
        $builder->select('
            animals.*,
            pens.name AS pen,
            animal_types.name AS animal_type,
            breeds.name AS breed,
            companies.name AS company,
            countries.name AS country
            ');
        $builder->join('pens', 'pens.id = animals.pen_id', 'left');
        $builder->join('animal_types', 'animal_types.id = animals.animal_type_id', 'left');
        $builder->join('breeds', 'breeds.id = animals.breed_id', 'left');
        $builder->join('companies', 'companies.id = animals.company_id', 'left');
        $builder->join('countries', 'countries.id = animals.country_id', 'left');

        $data['animals'] = $builder->get()->getResultArray();

        $penModel       = new PenModel();
        $typeModel      = new AnimalTypeModel();
        $breedModel     = new BreedModel();
        $companyModel   = new CompanyModel();
        $countryModel   = new CountryModel();

        $data['pens']        = $penModel->findAll();
        $data['animalTypes'] = $typeModel->findAll();
        $data['breeds']      = $breedModel->findAll();
        $data['companies']   = $companyModel->findAll();
        $data['countries']   = $countryModel->findAll();