xampp/htdocs/ci4-login/app/Controllers/AnimalMilkController.php

SELECT `animal_milk`.*, `animals`.`tag_id`
FROM `animal_milk`
JOIN `animals` ON `animals`.`id` = `animal_milk`.`animal_id`
ORDER BY `animal_milk`.`date` DESC
SELECT *
FROM `animals`
WHERE `sex` = 'Female'
---
    public function animalMilkList()
    {
        $milkModel    = new AnimalMilkModel();
        $animalModel  = new AnimalModel();

    $date = $this->request->getGet('date') ?? date('Y-m-d'); // default to today

    $builder = $milkModel
    ->select('animal_milk.*, animals.tag_id')
    ->join('animals', 'animals.id = animal_milk.animal_id');

    if ($date) {
        $builder->where('animal_milk.date', $date);
    }

    $data['animal_milk'] = $builder->orderBy('animal_milk.date', 'DESC')->findAll();
    $data['female_animals'] = $animalModel->where('sex', 'Female')->findAll();