xampp/htdocs/ci4-login/app/Controllers/DailyMilkingController.php

    public function dailyMilkingList()
    {
        $model = new DailyMilkingModel();

        $start_date = $this->request->getGet('start_date');
        $end_date   = $this->request->getGet('end_date');

        $query = $model->orderBy('date', 'DESC');

        if ($start_date && $end_date) {
            $query->where('date >=', $start_date)->where('date <=', $end_date);
        } elseif ($start_date) {
            $query->where('date >=', $start_date);
        } elseif ($end_date) {
            $query->where('date <=', $end_date);
        }

        $data['daily_milking'] = $query->findAll();
---
SELECT *
FROM `daily_milking`
WHERE `date` >= '2025-07-23'
AND `date` <= '2025-07-23'
ORDER BY `date` DESC