xampp/htdocs/ci4-login/app/Controllers/DewormingScheduleController.php

SELECT `deworming_schedules`.*, `deworming`.`name` AS `deworming_name`
FROM `deworming_schedules`
JOIN `deworming` ON `deworming`.`id` = `deworming_schedules`.`deworming_id`
ORDER BY `deworming_schedules`.`date` DESC
SELECT *
FROM `deworming`
---
    public function dewormingScheduleList()
    {
        $scheduleModel   = new DewormingScheduleModel();
        $dewormingModel  = new DewormingModel();

        $data['deworming_schedules'] = $scheduleModel
        ->select('deworming_schedules.*, deworming.name AS deworming_name')
        ->join('deworming', 'deworming.id = deworming_schedules.deworming_id')
        ->orderBy('deworming_schedules.date', 'DESC')
        ->findAll();

        $data['dewormings'] = $dewormingModel->findAll();

INSERT INTO `deworming_schedules` (`month`, `date`, `deworming_id`, `created_at`, `updated_at`) VALUES ('August', '2025-07-10', '3', '2025-07-21 09:49:54', '2025-07-21 09:49:54')
---
    public function addDewormingSchedule()
    {
        $scheduleModel = new DewormingScheduleModel();

        $data = [
            'month'        => $this->request->getPost('month'),
            'date'         => $this->request->getPost('date'),
            'deworming_id' => $this->request->getPost('deworming_id'),
            'comments'     => $this->request->getPost('comments'),
        ];

        $scheduleModel->insert($data);