xampp/htdocs/ci4-login/app/Controllers/FarmHeadController.php

    public function farmHeadList()
    {
        $model = new FarmHeadModel();

        $data['farm_head'] = $model->orderBy('created_at', 'DESC')->findAll();
---
SELECT *
FROM `farm_head`
ORDER BY `created_at` DESC