xampp/htdocs/ci4-login/app/Controllers/FeedingConsumptionController.php

SELECT SUM(`quantity`) AS `quantity`
FROM `feed_consumption`
WHERE `date` = '2025-07-15'
 LIMIT 1
SELECT `stock_registration`.*
FROM `stock_registration`
JOIN `stock_heads` ON `stock_heads`.`id` = `stock_registration`.`head_id`
WHERE `stock_heads`.`name` = 'Feeding'
SELECT `feed_consumption`.*, `stock_registration`.`product_name`
FROM `feed_consumption`
JOIN `stock_registration` ON `stock_registration`.`id` = `feed_consumption`.`product_id`
WHERE `feed_consumption`.`date` = '2025-07-15'
---
    public function feedingConsumptionList()
    {
        $model = new FeedConsumptionModel();
        $stockModel = new StockRegistrationModel();

        $selectedDate = $this->request->getGet('date') ?? date('Y-m-d');

        $totalQuantity = $model
        ->selectSum('quantity')
        ->where('date', $selectedDate)
        ->first()['quantity'] ?? 0;

        $feedingProducts = $stockModel
        ->select('stock_registration.*')
        ->join('stock_heads', 'stock_heads.id = stock_registration.head_id')
        ->where('stock_heads.name', 'Feeding')
        ->findAll();

        $consumptions = $model
        ->select('feed_consumption.*, stock_registration.product_name')
        ->join('stock_registration', 'stock_registration.id = feed_consumption.product_id')
        ->where('feed_consumption.date', $selectedDate)
        ->findAll();

INSERT INTO `feed_consumption` (`product_id`, `quantity`, `date`, `created_at`, `updated_at`) VALUES ('9', '35', '2025-07-27', '2025-07-27 05:00:52', '2025-07-27 05:00:52')
---
    public function addFeedingConsumption()
    {
        $model = new FeedConsumptionModel();

        $data = [
            'product_id' => $this->request->getPost('product_id'),
            'quantity'   => $this->request->getPost('quantity'),
            'date'       => $this->request->getPost('date'),
        ];

        $model->insert($data);