xampp/htdocs/ci4-login/app/Controllers/LedgerController.php

SELECT *
FROM `account_heads`
ORDER BY `name`
---
    public function accountLedger()
    {
        $tenantModel = new TenantsModel();
        $account_heads = $this->accountHeadModel->orderBy('name')->findAll();