xampp/htdocs/ci4-login/app/Controllers/Manage.php

    public function employees()
    {
        $model = new UserModel();
        $groupModel = new PermissionGroupModel();

        $data['employees'] = $model->findAll();
        $data['permissionGroups'] = $groupModel->findAll();
---
SELECT *
FROM `users`
SELECT *
FROM `permission_groups`

    public function permissions()
    {
        $model = new PermissionModel();
        $data['permissions'] = $model->findAll();
---
SELECT *
FROM `permissions`

    public function addPermission()
    {
        $model = new PermissionModel();

        $data = [
            'name' => $this->request->getPost('name'),
            'slug' => $this->request->getPost('slug'),
            'created_at' => date('Y-m-d H:i:s'),
            'updated_at' => date('Y-m-d H:i:s'),
        ];

        if ($model->insert($data)) {
---
INSERT INTO `permissions` (`name`, `slug`, `created_at`, `updated_at`) VALUES ('CanDeleteJournalVoucher', 'delete_journal_voucher', '2025-07-27 13:42:12', '2025-07-27 13:42:12')

    public function deletePermission($id)
    {
        $model = new PermissionModel();
        if ($model->delete($id)) {
            return redirect()->to('/manage/permissions')->with('success', 'Permission deleted successfully.');
---
SELECT *
FROM `permissions`

    public function addPermissionGroup()
    {
        $groupModel = new PermissionGroupModel();
        $groupPermModel = new PermissionGroupPermissionModel();

        $groupData = [
            'name' => $this->request->getPost('name'),
            'created_at' => date('Y-m-d H:i:s'),
            'updated_at' => date('Y-m-d H:i:s'),
        ];

        if ($groupModel->insert($groupData)) {
            $groupId = $groupModel->getInsertID();
            $selectedPermissions = $this->request->getPost('permissions') ?? [];

            foreach ($selectedPermissions as $permId) {
                $groupPermModel->insert([
                    'permission_group_id' => $groupId,
                    'permission_id' => $permId
                ]);
            }

            return redirect()->to('/manage/permission_groups')->with('success', 'Permission group added successfully.');
---
SELECT *
FROM `permissions`