xampp/htdocs/ci4-login/app/Controllers/MedicineConsumptionController.php

    public function medicineConsumptionList()
    {
        $model = new MedicineConsumptionModel();
        $stockModel = new StockRegistrationModel();

        $selectedDate = $this->request->getGet('date') ?? date('Y-m-d');

        $totalQuantity = $model
        ->selectSum('quantity')
        ->where('date', $selectedDate)
        ->first()['quantity'] ?? 0;

        $medicineProducts = $stockModel
        ->select('stock_registration.*')
        ->join('stock_heads', 'stock_heads.id = stock_registration.head_id')
        ->where('stock_heads.name', 'Medication')
        ->findAll();

        $consumptions = $model
        ->select('medicine_consumption.*, stock_registration.product_name')
        ->join('stock_registration', 'stock_registration.id = medicine_consumption.product_id')
        ->where('medicine_consumption.date', $selectedDate)
        ->findAll();
---
SELECT SUM(`quantity`) AS `quantity`
FROM `medicine_consumption`
WHERE `date` = '2025-07-24'
 LIMIT 1
SELECT `stock_registration`.*
FROM `stock_registration`
JOIN `stock_heads` ON `stock_heads`.`id` = `stock_registration`.`head_id`
WHERE `stock_heads`.`name` = 'Medication'
SELECT `medicine_consumption`.*, `stock_registration`.`product_name`
FROM `medicine_consumption`
JOIN `stock_registration` ON `stock_registration`.`id` = `medicine_consumption`.`product_id`
WHERE `medicine_consumption`.`date` = '2025-07-24'