xampp/htdocs/ci4-login/app/Controllers/MilkConsumptionController.php

    public function milkConsumptionList()
    {
        $model = new MilkConsumptionModel();

        $selectedDate = $this->request->getGet('date') ?? date('Y-m-d');

        $data['milk_consumption'] = $model
        ->select('milk_consumption.*, farm_head.head_name')
        ->join('farm_head', 'farm_head.id = milk_consumption.farm_head_id')
        ->where('milk_consumption.date', $selectedDate)
        ->orderBy('milk_consumption.date', 'DESC')
        ->findAll();

        $farmHeadModel = new FarmHeadModel();
        $data['farm_heads'] = $farmHeadModel->findAll();
---
SELECT `milk_consumption`.*, `farm_head`.`head_name`
FROM `milk_consumption`
JOIN `farm_head` ON `farm_head`.`id` = `milk_consumption`.`farm_head_id`
WHERE `milk_consumption`.`date` = '2025-08-02'
ORDER BY `milk_consumption`.`date` DESC
SELECT *
FROM `farm_head`