xampp/htdocs/ci4-login/app/Controllers/MilkInOutController.php

    public function milkInOutDetails()
    {
        $date = $this->request->getGet('date') ?? date('Y-m-d');

        $milkingModel = new DailyMilkingModel();
        $consumptionModel = new MilkConsumptionModel();

        $dailyMilking = $milkingModel->where('date', $date)->findAll();
        $milkConsumption = $consumptionModel->select('milk_consumption.*, farm_head.head_name')
        ->join('farm_head', 'milk_consumption.farm_head_id = farm_head.id')
        ->where('milk_consumption.date', $date)
        ->findAll();
---
SELECT *
FROM `daily_milking`
WHERE `date` = '2025-07-23'
SELECT `milk_consumption`.*, `farm_head`.`head_name`
FROM `milk_consumption`
JOIN `farm_head` ON `milk_consumption`.`farm_head_id` = `farm_head`.`id`
WHERE `milk_consumption`.`date` = '2025-07-23'