xampp/htdocs/ci4-login/app/Controllers/PayrollController.php

    public function salaryPayments()
    {
        $payrollModel = new EmployeePayrollModel();
        $userModel = new UserModel();

        $salaryPayments = $payrollModel
        ->select('employee_payrolls.*, users.firstname, users.lastname')
        ->join('users', 'users.id = employee_payrolls.user_id')
        ->orderBy('employee_payrolls.salary_month', 'DESC')
        ->findAll();

        $employees = $userModel->where('is_active', 1)->orderBy('firstname')->findAll();
---
SELECT `employee_payrolls`.*, `users`.`firstname`, `users`.`lastname`
FROM `employee_payrolls`
JOIN `users` ON `users`.`id` = `employee_payrolls`.`user_id`
ORDER BY `employee_payrolls`.`salary_month` DESC
SELECT *
FROM `users`
WHERE `is_active` = 1
ORDER BY `firstname`

        $builder->orderBy('users.firstname', 'ASC');
        $payrolls = $builder->get()->getResultArray();

        $employees = $userModel->orderBy('firstname')->findAll();
---
SELECT *
FROM `users`
ORDER BY `firstname`