xampp/htdocs/ci4-login/app/Controllers/ProfileController.php

    public function index()
    {
        $session = session();
        $userId = $session->get('user_id');

        $db = \Config\Database::connect();
        $user = $db->table('users')->where('id', $userId)->get()->getRow();
---
SELECT *
FROM `users`
WHERE `id` = '9'