xampp/htdocs/ci4-login/app/Controllers/ReceiptVoucherController.php

    public function receiptVoucher()
    {
        $vouchers = $this->voucherModel
        ->where('voucher_type', 'receipt')
        ->orderBy('date', 'DESC')
        ->findAll();

        foreach ($vouchers as &$voucher) {
            $voucher['entries'] = $this->voucherEntryModel
            ->where('voucher_id', $voucher['id'])
            ->findAll();
        }

        $account_heads = $this->accountHeadModel->orderBy('name')->findAll();
---
SELECT *
FROM `vouchers`
WHERE `voucher_type` = 'receipt'
ORDER BY `date` DESC
SELECT *
FROM `voucher_entries`
WHERE `voucher_id` = '19'
SELECT *
FROM `account_heads`
ORDER BY `name`