xampp/htdocs/ci4-login/app/Controllers/ScheduleController.php

    public function scheduleList()
    {
        $scheduleModel = new ScheduleModel();
        $animalModel   = new AnimalModel();
        $eventModel    = new EventModel();

        $data['schedules'] = $scheduleModel
            ->select('schedules.*, animals.tag_id as animal_tag, events.name as event_name')
            ->join('animals', 'animals.id = schedules.tag_id')
            ->join('events', 'events.id = schedules.event_id')
            ->orderBy('schedules.date', 'DESC')
            ->findAll();

        $data['animals'] = $animalModel->findAll();
        $data['events']  = $eventModel->findAll();
---
SELECT `schedules`.*, `animals`.`tag_id` as `animal_tag`, `events`.`name` as `event_name`
FROM `schedules`
JOIN `animals` ON `animals`.`id` = `schedules`.`tag_id`
JOIN `events` ON `events`.`id` = `schedules`.`event_id`
ORDER BY `schedules`.`date` DESC
SELECT *
FROM `animals`
SELECT *
FROM `events`