xampp/htdocs/ci4-login/app/Controllers/StockLedgerController.php

SELECT *
FROM `stock_heads`
SELECT `stock_registration`.*, `stock_heads`.`name` AS `head_name`, `stock_units`.`name` AS `unit_name`
FROM `stock_registration`
JOIN `stock_heads` ON `stock_heads`.`id` = `stock_registration`.`head_id`
JOIN `stock_units` ON `stock_units`.`id` = `stock_registration`.`unit_id`
WHERE `stock_registration`.`is_stock_item` = 1
AND `stock_registration`.`head_id` = '2'
---
    public function stockLedger()
    {
        $fromDate = $this->request->getGet('from_date') ?? date('Y-m-d');
        $toDate = $this->request->getGet('to_date') ?? date('Y-m-d');
        $selectedHead = $this->request->getGet('head_id');

        $stockModel = new StockRegistrationModel();
        $headModel = new StockHeadModel();
        $feedingModel = new FeedConsumptionModel();
        $medicineModel = new MedicineConsumptionModel();

        $heads = $headModel->findAll();

        if (!$selectedHead && !empty($heads)) {
            $selectedHead = $heads[0]['id'];
        }

        $stocks = $stockModel->select('stock_registration.*, stock_heads.name AS head_name, stock_units.name AS unit_name')
        ->join('stock_heads', 'stock_heads.id = stock_registration.head_id')
        ->join('stock_units', 'stock_units.id = stock_registration.unit_id')
        ->where('stock_registration.is_stock_item', 1)
        ->where('stock_registration.head_id', $selectedHead)
        ->findAll();