xampp/htdocs/ci4-login/app/Controllers/VaccinationScheduleController.php

SELECT `vaccination_schedules`.*, `vaccinations`.`name` AS `vaccination_name`
FROM `vaccination_schedules`
JOIN `vaccinations` ON `vaccinations`.`id` = `vaccination_schedules`.`vaccination_id`
ORDER BY `vaccination_schedules`.`date` DESC
SELECT *
FROM `vaccinations`
---
    public function vaccinationScheduleList()
    {
        $scheduleModel     = new VaccinationScheduleModel();
        $vaccinationModel  = new VaccinationModel();

        $data['vaccination_schedules'] = $scheduleModel
        ->select('vaccination_schedules.*, vaccinations.name AS vaccination_name')
        ->join('vaccinations', 'vaccinations.id = vaccination_schedules.vaccination_id')
        ->orderBy('vaccination_schedules.date', 'DESC')
        ->findAll();

        $data['vaccinations'] = $vaccinationModel->findAll();

INSERT INTO `vaccination_schedules` (`month`, `date`, `vaccination_id`, `comments`, `created_at`, `updated_at`) VALUES ('January', '2025-07-09', '2', 'Booster dose required', '2025-07-21 07:12:30', '2025-07-21 07:12:30')
---
    public function addVaccinationSchedule()
    {
        $scheduleModel = new VaccinationScheduleModel();

        $data = [
            'month'          => $this->request->getPost('month'),
            'date'           => $this->request->getPost('date'),
            'vaccination_id' => $this->request->getPost('vaccination_id'),
            'comments'       => $this->request->getPost('comments'),
        ];

        $scheduleModel->insert($data);