xampp/htdocs/ci4-login/app/Views/Payroll/salaryPayments.php

SELECT `voucher_number`
FROM `vouchers`
WHERE `id` = '43'
---
                            <td>
                                <?php if ($row['voucher_id']): ?>
                                <?php
                                    $voucher = db_connect()
                                    ->table('vouchers')
                                    ->select('voucher_number')
                                    ->where('id', $row['voucher_id'])
                                    ->get()
                                    ->getRow();